
// Description:
//   アルベド語変換
//
// Notes:
//   ja-alb [keyword] で keyword をアルベド語に変換する
const ja = [
  'あ', 'い', 'う', 'え', 'お',
  'か', 'き', 'く', 'け', 'こ',
  'さ', 'し', 'す', 'せ', 'そ',
  'た', 'ち', 'つ', 'て', 'と',
  'な', 'に', 'ぬ', 'ね', 'の',
  'は', 'ひ', 'ふ', 'へ', 'ほ',
  'ま', 'み', 'む', 'め', 'も',
  'や', 'ゆ', 'よ',
  'ら', 'り', 'る', 'れ', 'ろ',
  'わ', 'を', 'ん',
  'が', 'ぎ', 'ぐ', 'げ', 'ご',
  'ざ', 'じ', 'ず', 'ぜ', 'ぞ',
  'だ', 'ぢ', 'づ', 'で', 'ど',
  'ば', 'び', 'ぶ', 'べ', 'ぼ',
  'ぱ', 'ぴ', 'ぷ', 'ぺ', 'ぽ'
]

const albhed = [
  'ワ', 'ミ', 'フ', 'ネ', 'ト',
  'ア', 'チ', 'ル', 'テ', 'ヨ',
  'ラ', 'キ', 'ヌ', 'ヘ', 'ホ',
  'サ', 'ヒ', 'ユ', 'セ', 'ソ',
  'ハ', 'シ', 'ス', 'メ', 'オ',
  'マ', 'リ', 'ク', 'ケ', 'ロ',
  'ヤ', 'イ', 'ツ', 'レ', 'コ',
  'タ', 'ヲ', 'モ',
  'ナ', 'ニ', 'ウ', 'エ', 'ノ',
  'カ', 'ム', 'ン',
  'ダ', 'ジ', 'ヅ', 'デ', 'ゾ',
  'バ', 'ギ', 'ブ', 'ゲ', 'ボ',
  'ガ', 'ビ', 'グ', 'ベ', 'ゴ',
  'ザ', 'ヂ', 'ズ', 'ゼ', 'ド',
  'プ', 'ペ', 'パ', 'ポ', 'ピ'
]

module.exports = (robot) => {
robot.respond(/ja-alb (.+)/i, function(msg) {
    const keyword = msg.match[1].split('')
    const jpIndex = keyword.map(val => ja.indexOf(val))
    const translatedKeyword = jpIndex.map(val => albhed[val]).join('')
    return msg.send(`アルベド語では \`${translatedKeyword}\` ですよ`)
  });
}
